app/controllers/students_controller.rb

  def show
    @students = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (1) LIMIT 1